<a href="https://colab.research.google.com/github/KYOH95/Database_Studies/blob/main/(DE_8%EA%B8%B0)_2%EC%A3%BC%EC%B0%A8_SQL_%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주피터 SQL 엔진 설정

In [20]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [21]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://kakasi18:Kakasi18!1@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

'Connected: kakasi18@dev'

다양한 SELECT 실행해보기

In [22]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [23]:
%%sql

SELECT COUNT(1)
FROM raw_data.session_timestamp;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [24]:
%%sql

SELECT *
FROM raw_data.session_timestamp
LIMIT 10

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('00029153d12ae1c9abe59c17ff2e0895', datetime.datetime(2019, 10, 18, 14, 14, 5, 100000)),
 ('0004289ee1c7b8b08c77e19878106ae3', datetime.datetime(2019, 11, 16, 21, 20, 14, 447000)),
 ('0006246bee639c7a7b11a08e34dd3cc6', datetime.datetime(2019, 8, 10, 16, 33, 14, 980000)),
 ('0006dd05ea1e999ddaa041a7091b7b36', datetime.datetime(2019, 7, 6, 19, 54, 15, 83000)),
 ('000958fdaefe0dd06f5d7c4e4a5f28d1', datetime.datetime(2019, 11, 2, 14, 52, 30, 183000)),
 ('000a3f777828d2cdbee98887561aa130', datetime.datetime(2019, 11, 29, 16, 33, 55)),
 ('000a91f3e374e6147d58ed1814247508', datetime.datetime(2019, 7, 17, 14, 24, 16, 880000)),
 ('000cb7efa8a05429dd5309b4bea2eb0c', datetime.datetime(2019, 7, 23, 13, 39, 28)),
 ('000d0c74074191add6f22e0004db8f76', datetime.datetime(2019, 8, 21, 14, 48, 36)),
 ('000d54aadcedee0739d39127955f2cdb', datetime.datetime(2019, 9, 21, 21, 16, 29))]

In [25]:
%%sql

SELECT DATE(ts) yearmonthday, sessionID
FROM raw_data.session_timestamp
LIMIT 10;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 7, 29), '0002ac0d783338cfeab0b2bdbd872cda'),
 (datetime.date(2019, 6, 24), '00053f5e11d1fe4e49a221165b39abc9'),
 (datetime.date(2019, 9, 26), '00056c20eb5a029583db75506953f1d9'),
 (datetime.date(2019, 10, 16), '00063cb5da1826febf178b669eea3250'),
 (datetime.date(2019, 5, 22), '0007cda84fafdcf42f96c4f4adb7f8ce'),
 (datetime.date(2019, 5, 2), '000c076c390a4c357313fca29e390ece'),
 (datetime.date(2019, 8, 13), '000dd3543ac84d906eae52e7c779bb2a'),
 (datetime.date(2019, 7, 25), '00106ac9184e7d54b570d0f0cb0c38b2'),
 (datetime.date(2019, 11, 2), '0011df6282fe8cf78feeab676fbc3c27'),
 (datetime.date(2019, 6, 15), '00126b47d5502dfb7d01f750ad23d813')]

In [26]:
%%sql

SELECT DATE(ts) date, sessionID
FROM raw_data.session_timestamp
ORDER BY ts desc
LIMIT 10;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 11, 30), '6309ff4befccf8ba77b16141fab763c6'),
 (datetime.date(2019, 11, 30), '42daed3b750cc5c6270636fddee0486d'),
 (datetime.date(2019, 11, 30), '398c674511e98d3e9bd40ba5bfa67af8'),
 (datetime.date(2019, 11, 30), '1e65c9f788d6382abc0ee60886e7fa4a'),
 (datetime.date(2019, 11, 30), 'ec6d363a01a8a0691d24b8556bc1fb61'),
 (datetime.date(2019, 11, 30), '8f48bd8292fc4540404dc9dae06175e6'),
 (datetime.date(2019, 11, 30), '89a76004709bb668a8aefb6306a6aed1'),
 (datetime.date(2019, 11, 30), '9cfaefd1e81f637fad6330ff16eb1f39'),
 (datetime.date(2019, 11, 30), 'bbf2f1c020c5e39734c73223784bd7b4'),
 (datetime.date(2019, 11, 30), 'bac82af401b714e895c9c46af11f76ea')]

In [27]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID) -- COUNT(1)
FROM raw_data.session_timestamp
GROUP BY 1 
LIMIT 10;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 18), 630),
 (datetime.date(2019, 7, 6), 435),
 (datetime.date(2019, 11, 2), 556),
 (datetime.date(2019, 7, 23), 526),
 (datetime.date(2019, 8, 1), 499),
 (datetime.date(2019, 10, 12), 619),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 6), 610),
 (datetime.date(2019, 9, 13), 543),
 (datetime.date(2019, 8, 18), 529)]

In [28]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 23), 678),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 12), 668),
 (datetime.date(2019, 10, 11), 665),
 (datetime.date(2019, 10, 29), 660),
 (datetime.date(2019, 10, 21), 653),
 (datetime.date(2019, 11, 5), 652),
 (datetime.date(2019, 11, 11), 651),
 (datetime.date(2019, 10, 14), 648),
 (datetime.date(2019, 11, 7), 645)]

In [29]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1
LIMIT 10; -- DESC

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

JOIN에 대해 배워보자. 일별 방문 유니크한 사용자의 수를 계산하고 싶다면?

In [30]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(usc.userID) -- 세션수 카운트와 동일. COUNT(NULL): 0, 그 이외의 모든 경우는 1을 리턴
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [31]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 21), 549),
 (datetime.date(2019, 10, 14), 541),
 (datetime.date(2019, 10, 11), 539),
 (datetime.date(2019, 10, 29), 535),
 (datetime.date(2019, 10, 23), 535),
 (datetime.date(2019, 10, 10), 533),
 (datetime.date(2019, 10, 8), 532),
 (datetime.date(2019, 10, 22), 529),
 (datetime.date(2019, 10, 18), 528),
 (datetime.date(2019, 10, 15), 526)]

In [32]:
%%sql

SELECT channel, count(st.sessionID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Facebook', 16791),
 ('Google', 16982),
 ('Instagram', 16831),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Youtube', 17091)]

In [33]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(67768,)]

판다스와 연동하는 방법

In [34]:
result = %sql SELECT * FROM raw_data.user_session_channel
df = result.DataFrame()

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
101520 rows affected.

In [35]:
df.head()

   userid                         sessionid  channel
0    1491  00029153d12ae1c9abe59c17ff2e0895  Organic
1      59  0002ac0d783338cfeab0b2bdbd872cda    Naver
2     117  0006246bee639c7a7b11a08e34dd3cc6  Youtube
3     572  0006dd05ea1e999ddaa041a7091b7b36  Organic
4     935  0007cda84fafdcf42f96c4f4adb7f8ce   Google

In [36]:
df.groupby(["channel"]).size()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
dtype: int64

In [37]:
df.groupby(["channel"])["sessionid"].count()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
Name: sessionid, dtype: int64

In [38]:
result = %sql SELECT * FROM raw_data.session_timestamp
df_st = result.DataFrame()

 * postgresql://kakasi18:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
101520 rows affected.

In [39]:
df_st['date'] = df_st['ts'].apply(lambda x: "%d-%02d-%02d" % (x.year, x.month, x.day))

In [40]:
df_st.head()

                          sessionid                      ts        date
0  00029153d12ae1c9abe59c17ff2e0895 2019-10-18 14:14:05.100  2019-10-18
1  0004289ee1c7b8b08c77e19878106ae3 2019-11-16 21:20:14.447  2019-11-16
2  0006246bee639c7a7b11a08e34dd3cc6 2019-08-10 16:33:14.980  2019-08-10
3  0006dd05ea1e999ddaa041a7091b7b36 2019-07-06 19:54:15.083  2019-07-06
4  000958fdaefe0dd06f5d7c4e4a5f28d1 2019-11-02 14:52:30.183  2019-11-02

In [41]:
df_st.groupby(["date"]).size()  # .sort_values(["date"])

date
2019-05-01    147
2019-05-02    161
2019-05-03    150
2019-05-04    142
2019-05-05    144
             ...
2019-11-26    633
2019-11-27    617
2019-11-28    516
2019-11-29    531
2019-11-30    562
Length: 214, dtype: int64

In [42]:
df_st.groupby(["date"])["sessionid"].count().reset_index(name='count').sort_values("date", ascending=False)

           date  count
213  2019-11-30    562
212  2019-11-29    531
211  2019-11-28    516
210  2019-11-27    617
209  2019-11-26    633
..          ...    ...
4    2019-05-05    144
3    2019-05-04    142
2    2019-05-03    150
1    2019-05-02    161
0    2019-05-01    147

[214 rows x 2 columns]